Revit 2024 API
Transaction.HasEnded Method
 Determines whether the transaction has ended already.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public bool HasEnded()
Visual Basic
Public Function HasEnded As Boolean
Visual C++
public:
bool HasEnded()
Return Value
 True if the transaction has already been committed or rolled back, False otherwise.
Remarks
 A transaction is ended by completing either the 'Commit' or 'RollBack' method. Another way of testing whether a transaction has ended is by testing the current status (see GetStatus()). It must be either 'TransactionStatus.Committed' or 'TransactionStatus.RolledBack'
See Also
Transaction Class
Autodesk.Revit.DB Namespace